-- Добавление 10 известных армянских писателей
INSERT INTO libr.author (author_name, author_surname, birth_date, death_date)
VALUES
('Levon', 'Shant', '1869-03-14', '1951-06-29'),
('Silva', 'Kaputikyan', '1919-01-20', '2006-08-25'),
('Hrant', 'Matevosyan', '1935-04-26', '2002-07-30'),
('Paruyr', 'Sevak', '1924-01-24', '1971-06-17'),
('Aksel', 'Bakunts', '1899-07-10', '1937-11-28'),
('Hovhannes ', 'Shiraz', '1915-04-27', '1984-05-14'),
('Hovhannes', 'Tumanyan', '1869-02-19', '1923-03-23'),
('Eghishe', 'Charenc', '1913-03-13', '1974-04-27'),
('Nairi', 'Zaryan', '1900-02-26', '1969-06-13'),
('Hamo', 'Sahyan', '1914-03-18', '1993-08-01');


-- Добавление 10 известных русских писателей
INSERT INTO libr.author (author_name, author_surname, birth_date, death_date)
VALUES
('Leo', 'Tolstoy', '1828-09-09', '1910-11-20'),
('Fyodor', 'Dostoevsky', '1821-11-11', '1881-02-09'),
('Anton', 'Chekhov', '1860-01-29', '1904-07-15'),
('Ivan', 'Turgenev', '1818-11-09', '1883-09-03'),
('Alexander', 'Pushkin', '1799-06-06', '1837-02-10'),
('Mikhail', 'Bulgakov', '1891-05-15', '1940-03-10'),
('Nikolai', 'Gogol', '1809-03-31', '1852-03-04'),
('Vladimir', 'Nabokov', '1899-04-22', '1977-07-02'),
('Aleksandr', 'Solzhenitsyn', '1918-12-11', '2008-08-03'),
('Boris', 'Pasternak', '1890-02-10', '1960-05-30');

-- Добавление 10 известных иностранных писателей
INSERT INTO libr.author (author_name, author_surname, birth_date, death_date)
VALUES
('William', 'Shakespeare', '1564-04-26', '1616-04-23'),
('Charles', 'Dickens', '1812-02-07', '1870-06-09'),
('Jane', 'Austen', '1775-12-16', '1817-07-18'),
('Ernest', 'Hemingway', '1899-07-21', '1961-07-02'),
('Gabriel', 'García Márquez', '1927-03-06', '2014-04-17'),
('Franz', 'Kafka', '1883-07-03', '1924-06-03'),
('Virginia', 'Woolf', '1882-01-25', '1941-03-28'),
('Mark', 'Twain', '1835-11-30', '1910-04-21'),
('J. D.', 'Salinger', '1919-01-01', '2010-01-27'),
('Hermann', 'Hesse', '1877-07-02', '1962-08-09');

--ДОБАВЛЕНИЕ ИЗДАТЕЛЬСТВ--
-- Русские издательства --
INSERT INTO libr.publisher(publisher_name,founding_year,country)
VALUES
('Русский Вестник', 1839, 'Россия'),
('Современник', 1836, 'Россия'),
('Эпоха', 1864, 'Россия'),
('Театр', 1885, 'Россия'),
('Посев', 1922, 'Россия'),
('Новый мир', 1925, 'Россия'),
('Москва', 1991, 'Россия'),
('Типография М.О. Вольф',1877,'Россия'),
('Типография И.Н. Кушнерева', 1869,'Россия'),
('Типография Художественной литературы', 1899,'Россия'),
('Первая книга', 1901, 'Россия'),
('Типография Глазунова', 1833, 'Россия'),
('Московские ведомости', 1830, 'Россия'),
('Русский вестник', 1839, 'Россия');

-- Иностранные издательства --
INSERT INTO libr.publisher(publisher_name,founding_year,country)
VALUES
('Penguin Random House', 2013, 'США'),
('HarperCollins Publishers', 1817, 'Великобритания'),
('Hachette Livre', 1826, 'Франция'),
('Simon & Schuster', 1924, 'США'),
('Bloomsbury Publishing', 1986,'Великобритания');

-- Армянские издательства --
INSERT INTO libr.publisher(publisher_name,founding_year,country)
VALUES
('Antares Publishing House', 2000, 'Армения'),
('Zangak Publishing', 2006, 'Армения'),
('Edit Print Publishing', 1996, 'Армения'),
('Սովետական հեռուստասերիա', 1965, 'Армения'),
( 'Սովետական գրականություն', 1930, 'Армения'),
('Լուսաբեր', 1928, 'Армения'),
('Գային', 1902, 'Армения'),
('Մանկական գրականություն', 1912, 'Армения');

--ДОБАВЛЕНИЕ КНИГ--
--Толстой
SELECT insert_book('Анна Каренина', 'Leo', 'Tolstoy', 'Типография М.О. Вольф', 1877, 864);
SELECT insert_book('Война и мир', 'Leo', 'Tolstoy', 'Типография И.Н. Кушнерева', 1869, 1274);
SELECT insert_book('Воскресение', 'Leo', 'Tolstoy', 'Типография Художественной литературы', 1899, 425);



--Достоевский:
SELECT insert_book('Преступление и наказание', 'Fyodor', 'Dostoevsky', 'Эпоха', 1866, 551);
SELECT insert_book('Идиот', 'Fyodor', 'Dostoevsky', 'Русский вестник', 1868, 656);
SELECT insert_book('Братья Карамазовы', 'Fyodor', 'Dostoevsky', 'Русский вестник', 1880, 824);

--Чехов:
SELECT insert_book('Вишневый сад', 'Anton', 'Chekhov', 'Русский вестник', 1904, 182);
SELECT insert_book('Три сестры','Anton', 'Chekhov', 'Первая книга', 1901, 231);
SELECT insert_book('Чайка', 'Anton', 'Chekhov', 'Русский вестник', 1896, 212);

--Тургенев:
SELECT insert_book('Отцы и дети','Ivan', 'Turgenev', 'Современник', 1862, 239);
SELECT insert_book('Накануне', 'Ivan', 'Turgenev','Современник', 1860, 257);
SELECT insert_book('Дворянское гнездо', 'Ivan', 'Turgenev', 'Современник', 1859, 226);

--Пушкин:
SELECT insert_book('Евгений Онегин','Alexander', 'Pushkin',  'Типография Глазунова', 1833, 237);
SELECT insert_book('Дубровский', 'Alexander', 'Pushkin',  'Московские ведомости', 1832, 57);
SELECT insert_book('Капитанская дочка', 'Alexander', 'Pushkin',  'Современник', 1836, 268);

--Paruyr Sevak:
SELECT insert_book('Սերը և ուստի', 'Paruyr', 'Sevak', 'Սովետական հեռուստասերիա', 1965, 240);
SELECT insert_book('Օրերի արևելք', 'Paruyr', 'Sevak', 'Սովետական գրականություն', 1967, 320);

--Aksel Bakunts:
SELECT insert_book('Արդյունավետ պատմություն', 'Aksel', 'Bakunts', 'Լուսաբեր', 1928, 234);
SELECT insert_book('Թերեւի մեջ', 'Aksel', 'Bakunts', 'Լուսաբեր', 1931, 224);

--Hovhannes Shiraz:
SELECT insert_book('Իմ մեծահասակները', 'Hovhannes', 'Shiraz', 'Սովետական գրականություն', 1951, 352);
SELECT insert_book('Գործունեություն', 'Hovhannes', 'Shiraz', 'Սովետական գրականություն', 1964, 222);

--Hovhannes Tumanyan:
SELECT insert_book('Գայլիկ դուռ', 'Hovhannes', 'Tumanyan', 'Գային', 1902, 236);
SELECT insert_book('Գիշերվա մեջ', 'Hovhannes', 'Tumanyan', 'Մանկական գրականություն', 1912, 122);

--Eghishe Charenc:
SELECT insert_book('Հաղթանակը', 'Eghishe', 'Charenc', 'Սովետական գրականություն', 1939, 230);
SELECT insert_book('Գլխավորին թանկարժեքները', 'Eghishe', 'Charenc', 'Սովետական գրականություն', 1951, 342);


--ДОБАВЛЕНИЕ ЧИТАТЕЛЕЙ--
INSERT INTO libr.reader (reader_name, reader_surname, birth_date, address, phone, email) VALUES
('Иван', 'Иванов', 1990, 'ул. Ленина, д. 10, кв. 5', '+7 (999) 123-45-67', 'ivanov@mail.com'),
('Ольга', 'Петрова', 1985, 'ул. Пушкина, д. 25, кв. 7', '+7 (999) 987-65-43', 'petrova@mail.com'),
('Петр', 'Сидоров', 1982, 'ул. Мира, д. 15, кв. 3', '+7 (999) 456-78-90', 'sidorov@mail.com'),
('Александр', 'Кузнецов', 1995, 'ул. Гагарина, д. 30, кв. 12', '+7 (999) 234-56-78', 'kuznetsov@mail.com'),
('Екатерина', 'Федорова', 1978, 'ул. Братьев Карамазовых, д. 7, кв. 2', '+7 (999) 765-43-21', 'fedorova@mail.com'),
('Денис', 'Новиков', 1991, 'ул. Советская, д. 40, кв. 6', '+7 (999) 111-22-33', 'novikov@mail.com'),
('Оксана', 'Морозова', 1987, 'ул. Лесная, д. 20, кв. 8', '+7 (999) 222-33-44', 'morozova@mail.com'),
('Сергей', 'Козлов', 1975, 'ул. Герцена, д. 5, кв. 9', '+7 (999) 333-44-55', 'kozlov@mail.com'),
('Анна', 'Смирнова', 1992, 'ул. Ленинградская, д. 2, кв. 4', '+7 (999) 444-55-66', 'smirnova@mail.com'),
('Максим', 'Лебедев', 1980, 'ул. Пушкина, д. 13, кв. 10', '+7 (999) 555-66-77', 'lebedev@mail.com'),
('Наталья', 'Волкова', 1983, 'ул. Жуковского, д. 18, кв. 11', '+7 (999) 666-77-88', 'volkova@mail.com'),
('Дмитрий', 'Калинин', 1994, 'ул. Калинина, д. 50, кв. 2', '+7 (999) 777-88-99', 'kalinin@mail.com'),
('Елена', 'Макарова', 1979,'ул. Первомайская, д. 12, кв. 9', '+7 (999) 888-99-00', 'makarova@mail.com'),
('Андрей', 'Кудрявцев', 1993, 'ул. Маяковского, д. 22, кв. 3', '+7 (999) 111-11-11', 'kudryavtsev@mail.com'),
('Алиса', 'Иванова', 1986, 'ул. Совхозная, д. 35, кв. 7', '+7 (999) 222-22-22', 'ivanova@mail.com'),
('Владимир', 'Петров', 1996, 'ул. Гоголя, д. 28, кв. 10', '+7 (999) 333-33-33', 'petrov@mail.com'),
('Евгений', 'Сидоров', 1981, 'ул. Крылова, д. 8, кв. 6', '+7 (999) 444-44-44', 'sidorov@mail.com'),
('Олеся', 'Кузнецова', 1990, 'ул. Революции, д. 13, кв. 8', '+7 (999) 555-55-55', 'kuznetsova@mail.com'),
('Артём', 'Федоров', 1987, 'ул. Чехова, д. 15, кв. 9', '+7 (999) 666-66-66', 'fedorov@mail.com'),
('Нина', 'Новикова', 1984, 'ул. Маркса, д. 20, кв. 10', '+7 (999) 777-77-77', 'novikova@mail.com'),
('Павел', 'Морозов', 1995, 'ул. Горького, д. 27, кв. 4', '+7 (999) 888-88-88', 'morozov@mail.com'),
('Татьяна', 'Козлова', 1976, 'ул. Октябрьская, д. 10, кв. 3', '+7 (999) 999-99-99', 'kozlova@mail.com');


